results/results_r5_large/results_r5_large_run1/oltp_read_only_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 109.78 qps: 1757.86 (r/w/o: 1538.11/0.00/219.76) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 118.20 qps: 1892.06 (r/w/o: 1655.45/0.00/236.61) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 132.40 qps: 2118.19 (r/w/o: 1853.39/0.00/264.80) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 135.50 qps: 2170.21 (r/w/o: 1899.20/0.00/271.00) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 134.60 qps: 2154.11 (r/w/o: 1884.91/0.00/269.20) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 131.50 qps: 2102.69 (r/w/o: 1839.69/0.00/263.00) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 121.40 qps: 1942.21 (r/w/o: 1699.40/0.00/242.80) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 119.30 qps: 1907.49 (r/w/o: 1668.99/0.00/238.50) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 107.90 qps: 1727.81 (r/w/o: 1511.91/0.00/215.90) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 100.70 qps: 1611.00 (r/w/o: 1409.60/0.00/201.40) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 106.80 qps: 1710.41 (r/w/o: 1496.81/0.00/213.60) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 109.00 qps: 1741.40 (r/w/o: 1523.40/0.00/218.00) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            199850
        write:                           0
        other:                           28550
        total:                           228400
    transactions:                        14275  (118.91 per sec.)
    queries:                             228400 (1902.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      118.9071
    time elapsed:                        120.0517s
    total number of events:              14275

Latency (ms):
         min:                                   14.84
         avg:                                   33.63
         max:                                  202.43
         95th percentile:                       65.65
         sum:                               480127.09

Threads fairness:
    events (avg/stddev):           3568.7500/9.55
    execution time (avg/stddev):   120.0318/0.01